<template lang="pug">
.container
  .page-title 
    h2 Die Rektion der Verben

  .page-block
    .page-title--small 
      h2 Akkusativ ohne Präposition
    TabsTraining( title='' :SlotData='SlotAkkusativohnePräposition' )
  .page-block
    .page-title--small 
      h2 Akkusativ mit Präposition
    TabsTraining( title='' :SlotData='SlotAkkusativmitPräposition' )

  .page-block
    .page-title--small 
      h2 Dativ ohne Präposition
    TabsTraining( title='' :SlotData='SlotDativohnePräposition' )
  .page-block
    .page-title--small 
      h2 Dativ mit Präposition
    TabsTraining( title='' :SlotData='SlotDativmitPräposition' )
  .page-block
    .page-title--small 
      h2 Doppelt gesteuerte Verben
    TabsTraining( title='A + A' :SlotData='SlotDoppeltAA' )
    TabsTraining( title='D + D' :SlotData='SlotDoppeltDD' )
    TabsTraining( title='D + A' :SlotData='SlotDoppeltDA' )
    TabsTraining( title='A + D' :SlotData='SlotDoppeltAD' )
    TabsTraining( title='A + G' :SlotData='SlotDoppeltAG' )

</template>
<script setup>
import Tabs from '@/components/Tabs.vue';
import TabsTraining from '@/components/TabsTraining.vue';

const SlotDoppeltAA = [

  {
    t0: 'пристраивать что-л к чему-л',
    t1: 'anbauen',
    t2: 'A',
    t3: 'an',
    t4: 'A',
  },
  {
    t0: 'напомнить кому-л о чём-л',
    t1: 'mahnen',
    t2: 'A',
    t3: 'an',
    t4: 'A',
  },
  {
    t0: 'завидовать кому-л в чём-л',
    t1: 'beneiden',
    t2: 'A',
    t3: 'um',
    t4: 'A',
  },
  {
    t0: 'просить (у) кого-л что-л, о чём-л',
    t1: 'bitten',
    t2: 'A',
    t3: 'um',
    t4: 'A',
  },
  {
    t0: 'принимать, считать кого-л кем-л, за кого-л',
    t1: 'halten',
    t2: 'A',
    t3: 'für',
    t4: 'A',
  },
  {
    t0: 'голосовать за кого-л, что-л против кого-л, чего-л',
    t1: 'stimmen',
    t2: 'für',
    t3: 'A',
    t4: 'gegen',
    t4: 'A',
  },

]
const SlotDoppeltDD = [

  {
    t0: 'наводить справки, осведомляться у кого-л, где-л о ком-л, чём-л',
    t1: 'erkundigen',
    t2: 'sich',
    t3: 'bei',
    t4: 'D',
    t5: 'nach',
    t6: 'D',
  },
  {
    t0: 'рассказ(ыв)ать кому-л о чём-л',
    t1: 'erzählen',
    t2: 'D',
    t3: 'von',
    t4: 'D',
  },
  {
    t0: 'не хватать, недоставать кому-л чего-л',
    t1: 'fehlen',
    t2: 'D',
    t3: 'an',
    t4: 'D',
  },
  {
    t0: 'помогать кому-л в чем-л',
    t1: 'helfen',
    t2: 'D',
    t3: 'bei',
    t4: 'D',
  },
  {
    t0: 'поздравлять кого-л с чем-л',
    t1: 'gratulieren',
    t2: 'D',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'говорить с кем-л о ком-л',
    t1: 'sprechen',
    t2: 'mit',
    t3: 'D',
    t4: 'von',
    t5: 'D',
  },
  {
    t0: 'требовать от кого-л чего-л',
    t1: 'verlangen    D',
    t2: 'von',
    t3: 'D',
    t4: 'nach',
    t5: 'D',
  },

]
const SlotDoppeltDA = [

  {
    t0: 'благодарить кого-л за что-л',
    t1: 'bedanken',
    t2: 'sich',
    t3: 'bei',
    t4: 'D',
    t5: 'für',
    t5: 'A',
  },
  {
    t0: 'пожаловаться кому-л, куда-л на кого-л, что-л',
    t1: 'beklagen',
    t2: 'sich',
    t3: 'bei',
    t4: 'D',
    t5: 'über',
    t6: 'A',
  },
  {
    t0: '(по)жаловаться кому-л, во что-л на кого-л, что-л',
    t1: 'beschweren',
    t2: 'sich',
    t3: 'bei',
    t4: 'D',
    t5: 'über',
    t6: 'A',
  },
  {
    t0: 'благодарить кого-л за что-л',
    t1: 'danken',
    t2: 'D',
    t3: 'für',
    t4: 'A',
  },
  {
    t0: 'узнать от кого-л о чём-л',
    t1: 'erfahren',
    t2: 'durch',
    t3: 'D',
    t4: 'über',
    t5: 'A',
  },
  {
    t0: 'говорить с кем-л о чём-л',
    t1: 'sprechen',
    t2: 'mit',
    t3: 'D',
    t4: 'über',
    t5: 'A',
  },
  {
    t0: 'мстить кому-л за что-л',
    t1: 'rächen',
    t2: 'an',
    t3: 'D',
    t4: 'für',
    t5: 'A',
  },
  {
    t0: 'переводить с какого-л языка на какой-л язык',
    t1: 'übersetzen',
    t2: 'aus',
    t3: 'D',
    t4: 'in',
    t5: 'A',
  },
  {
    t0: 'беседовать, разговаривать с кем-л о ком-л, чём-л',
    t1: 'unterhalten     ',
    t2: 'sich',
    t3: 'mit',
    t4: 'D',
    t5: 'über',
    t6: 'A',
  },

]
const SlotDoppeltAD = [

  {
    t0: 'отвлекать кого-л от чего-л',
    t1: 'abziehen',
    t2: 'A',
    t3: 'von',
    t4: 'D',
  },
  {
    t0: 'поручать кому-л что-л',
    t1: 'beauftragen',
    t2: 'A',
    t3: 'mit',
    t4: 'D',
  },
  {
    t0: 'поздравлять кого-л с чем-л',
    t1: 'beglückwünschen',
    t2: 'A',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'давать/предоставлять право кому-л на что-л',
    t1: 'berechtigen',
    t2: 'A',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'оберегать кого-л от чего-л',
    t1: 'behüten',
    t2: 'A',
    t3: 'vor',
    t4: 'D',
  },
  {
    t0: '(со)хранить, (у)беречь что-л от чего-л',
    t1: 'bewahren',
    t2: 'A',
    t3: 'vor',
    t4: 'D',
  },
  {
    t0: 'приглашать кого-л на что-л',
    t1: 'einladen',
    t2: 'A',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'отнимать кого-л, что-л у кого-л',
    t1: 'entziehen',
    t2: 'A',
    t3: '+',
    t4: 'D',
  },
  {
    t0: 'узнать, опознать кого-л, что-л по чему-л',
    t1: 'erkennen',
    t2: 'A',
    t3: 'an',
    t4: 'D',
  },
  {
    t0: 'назначить кого-л.кем-л, на какую-л должность',
    t1: 'ernennen',
    t2: 'A',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'воспитать кого-л кем-л, каким-л, в духе чего-л',
    t1: 'erziehen',
    t2: 'A',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'препятствовать кому-л в чём-л',
    t1: 'hindern',
    t2: 'A',
    t3: 'an',
    t4: 'D',
  },
  {
    t0: 'схватить кого-л за что-л',
    t1: 'greifen',
    t2: 'A',
    t3: 'nach',
    t4: 'D',
  },
  {
    t0: 'мешать кому-л в чем-л',
    t1: 'stören',
    t2: 'A',
    t3: 'bei',
    t4: 'D',
  },
  {
    t0: 'уговорить, упросить, уломать кого-л на что-л',
    t1: 'überreden',
    t2: 'A',
    t3: 'zu',
    t4: 'D',
  },
  {
    t0: 'предупреждать кого-л о чем-л',
    t1: 'warnen',
    t2: 'A',
    t3: 'vor',
    t4: 'D',
  },


]
const SlotDoppeltAG = [

  {
    t0: 'обвинять кого-л в чём-л',
    t1: 'beschuldigen',
    t2: 'A',
    t3: '+',
    t4: 'G',
  },
  {
    t0: 'смещать кого-л с какого-л поста, какой-л Должности',
    t1: 'entsetzen',
    t2: 'A',
    t3: '+',
    t4: 'G',
  },

]

const SlotDativmitPräposition = [

  {
    t0: 'начинать с чего-л',
    t1: 'anfangen',
    t2: 'mit',
  },

  {
    t0: 'прекратить, прервать что-л',
    t1: 'aufhören',
    t2: 'mit',
  },

  {
    t0: 'заниматься чем-л',
    t1: 'befassen',
    t2: 'sich',
    t3: 'mit',
  },

  {
    t0: 'обоснов(ыв)ать чем-л',
    t1: 'begründen',
    t2: 'mit',
  },

  {
    t0: 'заниматься чем-л',
    t1: 'beschäftigen',
    t2: 'sich',
    t3: 'mit',
  },

  {
    t0: 'начинать с чего-л.',
    t1: 'beginnen',
    t2: 'mit',
  },

  {
    t0: 'подготовить (что-то)',
    t1: 'fertig',
    t2: 'sein',
    t3: 'mit',
  },

  {
    t0: 'случиться с кем-то',
    t1: 'geschehen',
    t2: 'mit',
  },

  {
    t0: 'торговать чем-л, с кем-л',
    t1: 'handeln',
    t2: 'mit',
  },
  {
    t0: 'считаться с чем-л; учитывать, принимать во внимание что-л',
    t1: 'rechnen',
    t2: 'mit',
  },
  {
    t0: 'писать кому-л.',
    t1: 'schreiben',
    t2: 'mit',
  },
  {
    t0: 'переписываться с кем-л',
    t1: 'schreiben',
    t2: 'sich',
    t3: 'mit',
  },
  {
    t0: 'ругаться, браниться с кем-л',
    t1: 'schimpfen',
    t2: 'mit',
  },
  {
    t0: 'встречаться с кем-л',
    t1: 'treffen',
    t2: 'sich',
    t3: 'mit',
  },
  {
    t0: 'разговаривать по телефону с кем-л',
    t1: 'telefonieren',
    t2: 'mit',
  },
  {
    t0: 'женить на ком-л',
    t1: 'verheiraten',
    t2: 'mit',
  },
  {
    t0: 'способствовать чему-л',
    t1: 'beitragen',
    t2: 'zu',
  },
  {
    t0: 'решиться на что-л',
    t1: 'entschließen',
    t2: 'sich',
    t3: 'zu',
  },
  {
    t0: 'принадлежать к кому-л',
    t1: 'gehören',
    t2: 'zu',
  },
  {
    t0: 'годиться на что-л',
    t1: 'taugen',
    t2: 'zu',
  },
  {
    t0: 'проклясть, приговорить к чему-л',
    t1: 'verdammen',
    t2: 'zu',
  },
  {
    t0: 'опоздать к чему-л, на что-л',
    t1: 'verspäten',
    t2: 'sich',
    t3: 'zu',
  },
  {
    t0: 'избирать кем-л',
    t1: 'wählen',
    t2: 'zu',
  },
  {
    t0: 'превращаться в кого-л, во что-л',
    t1: 'werden',
    t2: 'zu',
  },
  {
    t0: 'сходить, выгружаться (с чего-л.)',
    t1: 'aussteigen',
    t2: 'aus',
  },
  {
    t0: 'состоять из чего-л',
    t1: 'bestehen',
    t2: 'aus',
  },
  {
    t0: 'исследовать что-л',
    t1: 'forschen',
    t2: 'nach',
  },
  {
    t0: 'гнаться, охотиться за кем-л, чем-л',
    t1: 'jagen',
    t2: 'nach',
  },
  {
    t0: 'руководствоваться чем-л',
    t1: 'richten',
    t2: 'sich',
    t3: 'nach',
  },
  {
    t0: 'пахнуть чем-л',
    t1: 'riechen',
    t2: 'nach',
  },
  {
    t0: 'звать кого-л',
    t1: 'rufen',
    t2: 'nach',
  },
  {
    t0: 'иметь вкус чего-л',
    t1: 'schmecken',
    t2: 'nach',
  },
  {
    t0: 'тосковать по кому-л, чему-л',
    t1: 'sehnen',
    t2: 'sich',
    t3: 'nach',
  },
  {
    t0: 'стремиться к чему-л',
    t1: 'streben',
    t2: 'nach',
  },
  {
    t0: 'ощупывать что-л',
    t1: 'tasten',
    t2: 'nach',
  },
  {
    t0: 'целиться в кого-л, во что-л',
    t1: 'zielen',
    t2: 'nach',
  },
  {
    t0: 'зависеть от чего-л, кого-л',
    t1: 'abhängen',
    t2: 'von',
  },
  {
    t0: 'отказываться от чего-л',
    t1: 'absagen',
    t2: 'von',
  },
  {
    t0: 'питаться, прокармливаться, добывать себе пропитание чем-л',
    t1: 'ernähren',
    t2: 'sich',
    t3: 'von',
  },
  {
    t0: 'быть какого-л мнения о ком, о чем-л',
    t1: 'halten',
    t2: 'von',
  },
  {
    t0: 'отказываться от кого, чего-л',
    t1: 'lassen',
    t2: 'von',
  },
  {
    t0: 'извлекать выгоду/прибыль из чего-л, пользоваться чем-л, наживаться на чём-л',
    t1: 'profitieren',
    t2: 'von',
  },
  {
    t0: 'говорить о чём-л',
    t1: 'reden',
    t2: 'von',
  },
  {
    t0: 'мечтать о ком-л',
    t1: 'schwärmen',
    t2: 'von',
  },
  {
    t0: 'молчать о чём-л',
    t1: 'schweigen',
    t2: 'von',
  },
  {
    t0: 'мечтать о чём-л',
    t1: 'träumen',
    t2: 'von',
  },
  {
    t0: 'убеждаться в чём-л',
    t1: 'überzeugen',
    t2: 'sich',
    t3: 'von',
  },
  {
    t0: 'прощаться с кем-л',
    t1: 'verabschieden',
    t2: 'sich',
    t3: 'von',
  },
  {
    t0: 'знать о чём-л',
    t1: 'wissen',
    t2: 'von',
  },
  {
    t0: 'свидетельствовать о чём-л',
    t1: 'zeugen',
    t2: 'von',
  },
  {
    t0: 'прибывать, приезжать куда-л',
    t1: 'ankommen',
    t2: 'in',
  },
  {
    t0: 'состоять, заключаться в чем-л',
    t1: 'bestehen',
    t2: 'in',
  },
  {
    t0: 'перелистывать что-л',
    t1: 'blättern',
    t2: 'in',
  },
  {
    t0: 'провалиться, потерпеть неудачу в чем-л',
    t1: 'durchfallen',
    t2: 'in',
  },
  {
    t0: 'работать (над чем-л.)',
    t1: 'arbeiten',
    t2: 'an',
  },
  {
    t0: 'участвовать в чем-л',
    t1: 'beteiligen',
    t2: 'sich',
    t3: 'an',
  },

  {
    t0: 'заболеть чем-л',
    t1: 'erkranken',
    t2: 'an',
  },
  {
    t0: 'клеиться, приклеиваться, приставать к кому-л, чему-л',
    t1: 'kleben',
    t2: 'an',
  },
  {
    t0: 'звонить (куда-л(в дверь)',
    t1: 'klingeln',
    t2: 'an',
  },
  {
    t0: 'болеть чем-л',
    t1: 'krank',
    t2: 'sein',
    t3: 'an',
  },
  {
    t0: 'страдать(болеть) чем-л.',
    t1: 'leiden',
    t2: 'an',
  },
  {
    t0: 'зависеть от чего-л, определяться чем-л.',
    t1: 'liegen',
    t2: 'an',
  },

  {
    t0: 'недоставать кому-л чего-л',
    t1: 'mangeln',
    t2: 'an',
  },
  {
    t0: 'грызть что-л',
    t1: 'nagen',
    t2: 'an',
  },
  {
    t0: 'дотрагиваться до чего-л, прикасаться к чему-л',
    t1: 'rühren',
    t2: 'an',
  },
  {
    t0: 'быть виноватым в чём-л',
    t1: 'schuld',
    t2: 'sein',
    t3: 'an',
  },
  {
    t0: 'умереть от чего-л',
    t1: 'sterben',
    t2: 'an',
  },
  {
    t0: 'принимать участие в чем-л',
    t1: 'teilnehmen',
    t2: 'an',
  },

  {
    t0: 'превосходить в чём-л',
    t1: 'überlegen',
    t2: 'sein',
    t3: 'an',
  },
  {
    t0: 'отчаиваться в чём-л',
    t1: 'verzweifeln',
    t2: 'an',
  },
  {
    t0: 'проезжать мимо чего-л',
    t1: 'vorbeifahren',
    t2: 'an',
  },
  {
    t0: 'проходить мимо чего-л',
    t1: 'vorbeigehen',
    t2: 'an',
  },
  {
    t0: 'сомневаться в чём-л, подвергать сомнению что-л',
    t1: 'zweifeln',
    t2: 'an',
  },
  {
    t0: 'настаивать на чем-л',
    t1: 'bestehen',
    t2: 'auf',
  },


]
const SlotDativohnePräposition = [
  {
    t0: 'избегать чего-л, кого-л',
    t1: 'ausweichen',
  },
  {
    t0: 'встречать кого-л',
    t1: 'begegnen',
  },
  {
    t0: 'вступать во что-л',
    t1: 'beitreten',
  },
  {
    t0: 'присутствовать на чём-л',
    t1: 'beiwohnen',
  },
  {
    t0: 'отнимать, забирать у кого-л',
    t1: 'benehmen',
  },
  {
    t0: 'следовать за кем/чем-л',
    t1: 'folgen',
  },
  {
    t0: 'нравиться кому-л',
    t1: 'gefallen',
  },
  {
    t0: 'слушаться кого-л, повиноваться кому-л',
    t1: 'gehorchen',
  },
  {
    t0: 'получаться (у кого-л)',
    t1: 'gelingen',
  },
  {
    t0: 'быть похожим на кого/что-л',
    t1: 'gleichen',
  },
  {
    t0: 'избегать чего-л',
    t1: 'entgehen',
  },
  {
    t0: 'убегать от кого-л, чего-л',
    t1: 'entlaufen',
  },
  {
    t0: 'заимствовать у кого-л, из чего-л',
    t1: 'entnehmen',
  },
  {
    t0: 'отнимать у кого-л',
    t1: 'entziehen',
  },
  {
    t0: 'увольнять кого-л',
    t1: 'kündigen',
  },
  {
    t0: '(по)следовать за кем-л, чем-л',
    t1: 'nachfolgen',
  },
  {
    t0: 'идти следом за кем-л, чем-л',
    t1: 'nachgehen',
  },
  {
    t0: 'приближаться к чему-л',
    t1: 'nähern',
    t2: 'sich',
  },
  {
    t0: 'случиться (с кем-л)',
    t1: 'passieren',
  },
  {
    t0: 'предотвращать что-л',
    t1: 'verbeugen',
  },
  {
    t0: 'быть обреченным на что-л',
    t1: 'verfallen',
  },
  {
    t0: 'представляться (кому-л)',
    t1: 'vorstellen',
    t2: 'sich',
  },
  {
    t0: 'предотвращать, предупреждать что-л',
    t1: 'vorbeugen',
  },
  {
    t0: 'слушать кого-л',
    t1: 'zuhören',
  },
  {
    t0: 'уговаривать кого-л',
    t1: 'zureden',
  },
  {
    t0: 'сердиться на кого-л, что-л',
    t1: 'zürnen',
  },
  {
    t0: 'глядеть на кого-л, что-л',
    t1: 'zusehen',
  },
  {
    t0: 'соглашаться с кем-л, чем-л',
    t1: 'zustimmen',
  },
  {
    t0: 'случиться с кем-л, чем-л',
    t1: 'zustoßen',
  },


]

const SlotAkkusativmitPräposition = [
  {
    t0: 'просить о чём-л ',
    t1: 'ansprechen',
    t2: 'um',
  }, {
    t0: 'трудиться, корпеть над чем-л',
    t1: 'bemühen',
    t2: 'sich',
    t3: 'um',
  }, {
    t0: 'пода(ва)ть заявление о чем-л, претендовать на что-л, добиваться чего-л',
    t1: 'bewerben',
    t2: 'sich',
    t3: 'um',
  }, {
    t0: 'умолять о чём-л',
    t1: 'flehen',
    t2: 'um',
  }, {
    t0: 'говориться, речь идёт о ком-л, чём-л',
    t1: 'handeln',
    t2: 'sich',
    t3: 'um',

  },
  {
    t0: 'заботиться, беспокоиться о ком-л, чём-л',
    t1: 'kümmern',
    t2: 'sich',
    t3: 'um',
  },
  {
    t0: 'играть на что-л, ставить что-л на кон',
    t1: 'spielen',
    t2: 'um',
  },
  {
    t0: 'спорить, держать пари на что-л',
    t1: 'wetten',
    t2: 'um',
  },
  {
    t0: 'тратить, расходовать на что-л',
    t1: 'ausgeben',
    t2: 'für',
  },
  {
    t0: 'вдохновляться, восхищаться кем-л, чем-л',
    t1: 'begeistern',
    t2: 'sich',
    t3: 'für',
  },
  {
    t0: 'решиться на что-л',
    t1: 'entscheiden',
    t2: 'sich',
    t3: 'für',
  },
  {
    t0: 'интересоваться чем-л',
    t1: 'interessieren',
    t2: 'sich',
    t3: 'für',
  },
  {
    t0: 'заботиться о ком-л, чем-л',
    t1: 'sorgen',
    t2: 'für',
  },
  {
    t0: 'бороться с кем/чем-л, против кого/чего-л',
    t1: 'kämpfen',
    t2: 'gegen',
  },
  {
    t0: 'нарушить что-л, согрешить против чего-л',
    t1: 'verstoßen',
    t2: 'gegen',
  },

  {
    t0: 'обращать внимание на кого-л., что-л; внимательно следить за кем-л, чем-л',
    t1: 'achten',
    t2: 'auf',
  },
  {
    t0: 'зависеть от чего-л',
    t1: 'ankommen',
    t2: 'auf',
  },
  {
    t0: 'отвечать на что-л',
    t1: 'antworten',
    t2: 'auf',
  },
  {
    t0: 'следить, присматривать, наблюдать за чем-л',
    t1: 'aufpassen',
    t2: 'auf',
  },
  {
    t0: 'ограничиваться чем-л',
    t1: 'beschränken',
    t2: 'sich',
    t3: 'auf',
  },

  {
    t0: 'настаивать на чём-л',
    t1: 'bestehen',
    t2: 'auf',
  },
  {
    t0: 'ссылаться на что-л, затрагивать что-л',
    t1: 'beziehen',
    t2: 'sich',
    t3: 'auf',
  },
  {
    t0: 'указывать, намекать на что-л; предвещать, сулить что-л',
    t1: 'deuten',
    t2: 'auf',
  },
  {
    t0: 'согласиться, пойти на что-л',
    t1: 'eingehen',
    t2: 'auf',
  },
  {
    t0: 'уговорить, убедить кого-л',
    t1: 'einreden',
    t2: 'auf',
  },
  {
    t0: 'радоваться чему-л (предстоящему)',
    t1: 'freuen',
    t2: 'sich',
    t3: 'auf',
  },
  {
    t0: 'указывать на что-л',
    t1: 'hinweisen',
    t2: 'auf',
  },
  {
    t0: 'надеяться на что-л, кого-л',
    t1: 'hoffen',
    t2: 'auf',
  },
  {
    t0: 'придавать значение чему-л',
    t1: 'halten',
    t2: 'auf',
  },
  {
    t0: 'поджидать, подкарауливать кого-л',
    t1: 'lauern',
    t2: 'auf',
  },
  {
    t0: 'сосредоточи(ва)ться, (с)концентрироваться на чём-л, ком-л',
    t1: 'konzentrieren',
    t2: 'sich',
    t3: 'auf',
  },
  {
    t0: 'рассчитывать на что-л, кого-л',
    t1: 'rechnen',
    t2: 'auf',
  },
  {
    t0: 'быть гордым чем-л, кем-л',
    t1: 'stolz',
    t2: 'sein',
    t3: 'auf',
  },
  {
    t0: 'сталкиваться с чем-л, наталкиваться на что-л',
    t1: 'stoßen',
    t2: 'auf',
  },
  {
    t0: 'бранить, проклинать кого-л',
    t1: 'schelten',
    t2: 'auf',
  },
  {
    t0: 'стрелять в кого-л',
    t1: 'schießen',
    t2: 'auf',
  },
  {
    t0: '(вы)пить за что-л, кого-л',
    t1: 'trinken',
    t2: 'auf',
  },
  {
    t0: 'положиться на что-л, кого-л',
    t1: 'verlassen',
    t2: 'sich',
    t3: 'auf',
  },
  {
    t0: 'доверять чему-л, кому-л',
    t1: 'vertrauen',
    t2: 'auf',
  },
  {
    t0: 'отказаться от чего-л, пожертвовать, поступиться чем-л',
    t1: 'verzichten',
    t2: 'auf',
  },
  {
    t0: 'готовиться к чему-л',
    t1: 'vorbereiten',
    t2: 'sich',
    t3: 'auf',
  },
  {
    t0: 'ждать кого-л, чего-л',
    t1: 'warten',
    t2: 'auf',
  },
  {
    t0: 'подходить к кому-л; вступать в контакт, налаживать общение с кем-л',
    t1: 'zugehen',
    t2: 'auf',
  },
  {
    t0: 'заде(ва)ть за что-л., натолкнуться на что-л',
    t1: 'anstoßen',
    t2: 'an',
  },
  {
    t0: 'работать над чем-л',
    t1: 'arbeiten',
    t2: 'an',
  },
  {
    t0: 'думать о чём-л, ком-л',
    t1: 'denken',
    t2: 'an',
  },
  {
    t0: 'вспоминать о ком-л, чём-л',
    t1: 'erinnern',
    t2: 'sich',
    t3: 'an',
  },
  {
    t0: 'привыкать к чему-л, кому-л',
    t1: 'gewöhnen',
    t2: 'sich',
    t3: 'an',
  },
  {
    t0: 'верить во что-л',
    t1: 'glauben',
    t2: 'an',
  },
  {
    t0: 'граничить с чем-л',
    t1: 'grenzen',
    t2: 'an',
  },
  {
    t0: 'придерживаться чего-л',
    t1: 'halten',
    t2: 'sich',
    t3: 'an',
  },
  {
    t0: 'обращаться к кому-л',
    t1: 'richten',
    t2: 'sich',
    t3: 'an',
  },
  {
    t0: 'писать кому-л',
    t1: 'schreiben',
    t2: 'an',
  },
  {
    t0: 'обращаться к кому-л',
    t1: 'wenden',
    t2: 'sich',
    t3: 'an',
  },
  {
    t0: 'развлекаться чем-л',
    t1: 'amüsieren',
    t2: 'sich',
    t3: 'über',

  },
  {
    t0: 'злиться, сердиться на кого/что-л, из-за чего-л',
    t1: 'ärgern',
    t2: 'sich',
    t3: 'über',

  },
  {
    t0: 'волноваться, беспокоиться из-за чего-л, кого-л',
    t1: 'aufregen',
    t2: 'sich',
    t3: 'über',

  },
  {
    t0: 'сообщать, докладывать, рапортовать о чём-л',
    t1: 'berichten',
    t2: 'über',

  },
  {
    t0: 'дискутировать о чём-л, обсуждать что-л',
    t1: 'diskutieren',
    t2: 'über',

  },
  {
    t0: 'радоваться чему-л (свершившемуся)',
    t1: 'freuen',
    t2: 'sich',
    t3: 'über',

  },
  {
    t0: 'сообщать что-л, информировать о чём-л',
    t1: 'informieren',
    t2: 'über',
  },
  {
    t0: 'собирать информацию, справляться о чём-л; узнавать, выяснять что-л',
    t1: 'informieren',
    t2: 'sich',
    t3: 'über',
  },
  {
    t0: 'жаловаться на кого-л, что-л',
    t1: 'klagen',
    t2: 'über',
  },
  {
    t0: 'смеяться над кем-л, чем-л',
    t1: 'lachen',
    t2: 'über',
  },
  {
    t0: 'думать, размышлять о ком-л, чём-л',
    t1: 'nachdenken',
    t2: 'über',
  },
  {
    t0: 'говорить о ком-л',
    t1: 'reden',
    t2: 'über',
  },
  {
    t0: 'победить кого/что-л, выиграть у кого-л',
    t1: 'siegen',
    t2: 'über',
  },
  {
    t0: 'удивляться чему-л',
    t1: 'staunen',
    t2: 'über',
  },
  {
    t0: 'перевозить, переправлять; перешагнуть; переключать что-л',
    t1: 'übersetzen',
    t2: 'über',
  },
  {
    t0: 'располагать, распоряжаться чем-л',
    t1: 'verfügen',
    t2: 'über',
  },
  {
    t0: 'удивляться чему-л',
    t1: 'wundern',
    t2: 'sich',
    t3: 'über',
  },
  {
    t0: 'щипать за что-л',
    t1: 'kneifen',
    t2: 'in',

  }

]

const SlotAkkusativohnePräposition = [
  {
    t0: 'заходить за кем-л  (Когда я смогу забрать тебя?)',
    t1: 'Wann',
    t2: 'kann',
    t3: 'ich',
    t4: 'dich',
    t5: 'abholen',
    t6: '?',
  },
  {
    t0: 'звонить кому-л (Ему не обязательно было тебе звонить. musste)',
    t1: 'Er',
    t2: 'musste',
    t3: 'dich',
    t4: 'nicht',
    t5: 'anrufen',
    t6: '.',

  },
  {
    t0: 'стянуть, вынуть (вынуть ключ зажигания Zündschlüssel)',
    t1: 'den',
    t2: 'Zündschlüssel',
    t3: 'abziehen',
  },
  {
    t0: 'отвечать на что-л (ответить на приветствие Gruß)',
    t1: 'einen',
    t2: 'Gruß',
    t3: 'beantworten',
  },
  {
    t0: 'поручать кому-л (поручить кому-либо сделать что-либо )',
    t1: 'jemanden',
    t2: 'mit',
    t3: 'etwas',
    t4: 'beauftragen',
  },
  {
    t0: 'войти во что-л, куда-л (после морского путешествия наконец-то снова на твердую землю ступил      Seereise festen Boden)',
    t1: 'nach',
    t2: 'der',
    t3: 'Seereise',
    t4: 'endlich',
    t5: 'wieder',
    t6: 'festen',
    t7: 'Boden',
    t8: 'betreten',
  },
  {
    t0: 'нуждаться в чём-л (Мне нужно время для себя.)',
    t1: 'Ich',
    t2: 'brauche',
    t3: 'Zeit',
    t4: 'für',
    t5: 'mich',
    t6: '.',
  },
  {
    t0: 'достигать чего-л (Вы не смогли связаться с ним? konntest)',
    t1: 'Du',
    t2: 'konntest',
    t3: 'ihn',
    t4: 'nicht',
    t5: 'erreichen',
    t6: '?',
  },
  {
    t0: 'наслаждаться чем-л (Наслаждайтесь Вашим кексом. Cupcake)',
    t1: 'Genießen',
    t2: 'Sie',
    t3: 'Ihren',
    t4: 'Cupcake',
    t5: '.',
  },
  {
    t0: '(по)знакомиться с кем-л (Приятно познакомиться. Schön,)',
    t1: 'Schön',
    t2: ',',
    t3: 'dich',
    t4: 'kennen',
    t5: 'zu',
    t6: 'lernen',
    t7: '.',
  },
  {
    t0: 'руководить кем-л, чем-л (Я здесь, чтобы руководить вашим штабом. Stab)',
    t1: 'Ich',
    t2: 'bin',
    t3: 'hier',
    t4: ',',
    t5: 'um',
    t6: 'Ihren',
    t7: 'Stab',
    t8: 'zu',
    t9: 'leiten',
    t10: '.',
  },
  {
    t0: 'брать, взять, отнимать что-л (Этого у вас невозможно отнять. Ihnen)',
    t1: 'Das',
    t2: 'kann',
    t3: 'man',
    t4: 'Ihnen',
    t5: 'nicht',
    t6: 'nehmen',
    t7: '.',
  },
  {
    t0: 'играть во что-л, на чём-л (Давайте сыграем в игру. Spiel)',
    t1: 'Spielen',
    t2: 'wir',
    t3: 'ein',
    t4: 'Spiel',
    t5: '.',
  },
  {
    t0: 'мешать кому-л, беспокоить кого-л (Я уверен, что нам никто не помешает. sicher nicht)',
    t1: 'Ich',
    t2: 'bin',
    t3: 'sicher',
    t4: ',',
    t5: 'man',
    t6: 'wird',
    t7: 'uns',
    t8: 'nicht',
    t9: 'stören',
    t10: '.',
  },
  {
    t0: 'обижаться за что-л (Можешь ли ты на него обижаться?)',
    t1: 'Kannst',
    t2: 'du',
    t3: 'ihm',
    t4: 'das',
    t5: 'übelnehmen',
    t6: '?',
  },
  {
    t0: 'упрекать кого-л (Можешь ли ты обвинять меня? Kannst)',
    t1: 'Kannst',
    t2: 'du',
    t3: 'mir',
    t4: 'was',
    t5: 'vorwerfen',
    t6: '?',
  },
  {
    t0: 'предупреждать, предостерегать кого-л (Я пришел, чтобы предупредить тебя. kam)',
    t1: ' Ich',
    t2: 'kam',
    t3: ',',
    t4: 'um',
    t5: 'dich',
    t6: 'zu',
    t7: 'warnen',
    t8: '.',
  }

]


</script>

<style lang="scss" ></style>